/* If something went wrong, but the writing was generally successful */
" However, there was an error writing one or more of the files" = "しかし、ファイルの書込み中にエラーが発生しました。";

/* Title of an alert if there is an error getting content of a url */
"An Error Occurred" = "エラーが発生しました。";

/* Label to have the user select which folder to choose */
"Choose" = "選択";

/* Button to dismiss an action sheet */
"Dismiss" = "とじる";

/* Prompt user gets to enter a URL */
"Enter URL..." = "ＵＲＬを入力して下さい。";

/* No comment provided by engineer. */
"Expected content type %@, got %@" = "予想されるコンテンツのタイプ %1$@, 受信は %2$@　です。";

/* No comment provided by engineer. */
"Expected status code %@, got %d" = "予想されるステータスコード %1$@, 受信は %2$d　です。";

/* Toolbar item name for General Preferences */
"General" = "ジェネラル";

/* This is the current title of http options window that gets written */
"Options" = "オプション";

/* In the main screen, this is the verify button that formats the JSON */
"Verify" = "チェック";

/* In the main screen, this is the button that fetches data from a URL */
"Get Data" = "データを取得する";

/* In the main screen, this is the button that writes out files */
"Generate Files" = "ファイルを生成する";

/* Message when writing the files, nothing was written */
"No file were written to the disk" = "何も起こらなかったです。 もっと強さでリフレシュしてみて下さい。";

/* Error message to state the JSON didn't start with a {} or [] */
"JSON text did not start with array or object." = "ＪＳＯＮのテキストは、配列またはオブジェクトで開始されませんでした。";

/* Message in an actionsheet stating that the write is successful */
"Success!" = "成功！";

/* If there is nothing in the JSON field, state that there is nothing there */
"There is no content to parse." = "解析するためのコンテンツはありません。";

/* Success message in an action sheet */
"Your files have successfully been generated." = "ファイルは生成しました。";

/* Actionsheet message for stating that nothing was generated  */
"An error has occurred and no files have been generated." = "エラーが発生しましたので、ファイルが生成しませんでした。";

/* The title for the action sheet saying something went wrong */
"An error occurred while verifying the JSON" = "ＪＳＯＮをチェックした時エラーが発生しました。";

/* In the save portion, the label to choose what language */
"Output Language" = "出力言語";

/* In the save portion, the label to choose what the package is */
"Package Name" = "パッケージ名";

/* In the save portion, the prompt to specify what the base class is */
"Base Class" = "ベースファイル";

/* If there is nothing in the JSON field, state that there is nothing there */
"There is no content to parse." = "解析するためのコンテンツはありません。";

/* The prompt to tell the user they are about to overwrite the files in the existing application */
"This operation will overwrite files in this directory. Are you sure you want to continue?" = "同じ名前のファイルまたはフォルダが既に移動先に存在しています。置き換えると現在の内容が上書きされます。";

/* Cancel button in the overwrite files prompt */
"Cancel" = "キャンセル";

/* Button text to overwrite files */
"Overwrite Files" = "上書き";

/* The title of the prompt to tell the user they are about to overwrite the files in the existing application */
"Overwrite files?" = "ファイルを上書きしますか？";

/* In the save portion, for objective C, determine whether or not to use ARC */
"Use Automatic Reference Counting" = "自動参照カウントを使用して、";

/*************** HTTP OPTIONS WINDOW STRINGS *************/

/* Title for the Method box in the HTTP Options window */
"Method" = "法";

/* Title for the Headers box in the HTTP Options window */
"Headers" = "ヘッダ";

/* Title for the field to enter a HTTP header key */
/* Title for the column of HTTP header keys */
"Key" = "キーを";

/* Title for the field to enter a HTTP header value */
/* Title for the column of HTTP header values */
"Value" = "値は";

/* Title for the Add header button in the HTTP Options window */
"Add" = "追加";


